# flake8: noqa
import streamlit as st


def faq():
    st.markdown(
        """
## KnowledgeGPT ทำงานอย่างไร
เมื่อคุณอัปโหลดเอกสาร เอกสารจะถูกแบ่งออกเป็นส่วนเล็กๆ
และจัดเก็บไว้ในฐานข้อมูลชนิดพิเศษที่เรียกว่าดัชนีเวกเตอร์
ที่ช่วยให้สามารถค้นหาและเรียกค้นความหมายได้

เมื่อคุณถามคำถาม KnowledgeGPT จะค้นหาผ่าน
จัดทำเอกสารเป็นชิ้นๆ และค้นหาชิ้นที่เกี่ยวข้องมากที่สุดโดยใช้ดัชนีเวกเตอร์
จากนั้นจะใช้ GPT3 เพื่อสร้างคำตอบสุดท้าย

## ข้อมูลของฉันปลอดภัยหรือไม่?
ใช่ ข้อมูลของคุณปลอดภัย KnowledgeGPT จะไม่เก็บเอกสารของคุณหรือ
คำถาม. ข้อมูลที่อัปโหลดทั้งหมดจะถูกลบหลังจากที่คุณปิดแท็บเบราว์เซอร์.

## เหตุใดจึงใช้เวลานานมากในการจัดทำดัชนีเอกสารของฉัน
หากคุณใช้คีย์ OpenAI API ฟรี จะใช้เวลาสักครู่ในการจัดทำดัชนี
เอกสารของคุณ เนื่องจากคีย์ API ฟรีมีความเข้มงวด [rate limits](https://platform.openai.com/docs/guides/rate-limits/overview).
เพื่อเร่งกระบวนการจัดทำดัชนี คุณสามารถใช้คีย์ API แบบชำระเงินได้

## ตัวเลขแต่ละแหล่งมีความหมายว่าอะไร?
สำหรับเอกสาร PDF คุณจะเห็นหมายเลขอ้างอิงดังนี้: 3-12
เลขตัวแรกคือเลขหน้า และเลขตัวที่สองคือ
หมายเลขชิ้นในหน้านั้น สำหรับเอกสาร DOCS และ TXT
ตัวเลขตัวแรกตั้งไว้ที่ 1 และตัวเลขตัวที่สองคือตัวเลขก้อน

## คำตอบถูกต้อง 100% หรือไม่?
ไม่ คำตอบไม่ถูกต้อง 100% KnowledgeGPT ใช้ GPT-3 ในการสร้าง
คำตอบ GPT-3 เป็นโมเดลภาษาที่ทรงพลัง แต่บางครั้งก็ทำให้เกิดข้อผิดพลาด
และมีแนวโน้มที่จะเกิดอาการประสาทหลอน นอกจากนี้ KnowledgeGPT ยังใช้การค้นหาเชิงความหมาย
เพื่อค้นหาส่วนที่เกี่ยวข้องมากที่สุดและไม่เห็นเอกสารทั้งหมด
ซึ่งหมายความว่าอาจไม่สามารถค้นหาข้อมูลที่เกี่ยวข้องได้ทั้งหมดและ
อาจตอบได้ไม่หมดทุกคำถาม (โดยเฉพาะคำถามประเภทสรุป)
หรือคำถามที่ต้องใช้บริบทจากเอกสารมาก)

แต่สำหรับกรณีการใช้งานส่วนใหญ่ KnowledgeGPT นั้นแม่นยำมากและตอบได้
คำถามส่วนใหญ่ ตรวจสอบกับแหล่งที่มาเสมอเพื่อให้แน่ใจว่าคำตอบ
ถูกต้อง.
"""
    )
